[
  {
    "id": "Pip2048",
    "name": "2048",
    "version": "1.0.1",
    "description": "A classic 2048 game.",
    "type": "GAME",
    "instructions": "",
    "tip": "Use your brain! =]",
    "controls": "Use the LEFT WHEEL to shift the table Up / Down, UPPER RIGHT WHEEL to shift Left / Right. Push LEFT WHEEL Click to Reset. Press TOP TORCH button to exit the game.",
    "zip": "Pip2048.zip",
    "authors": [
      "@killes007"
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "AsteroPIPs",
    "name": "AsteroPIPs",
    "version": "1.0.0",
    "description": "AsteroPIPs is a simple game where you control a spaceship to shoot and avoid space rocks.",
    "type": "GAME",
    "instructions": "Control the spaceship and shoot the asteroids. Avoid colliding with them. The game ends when you hit an asteroid.",
    "tip": "Move and shoot is a good tactic!",
    "controls": "Use the LEFT WHEEL BUTTON to start / shoot, TUNE KNOB UP and DOWN for rotate, and PUSH to move forward. TOP TORCH button to exit the game.",
    "zip": "AsteroPIPs.zip",
    "authors": [
      "@killes007"
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "CustomRadio",
    "name": "Custom Radio",
    "version": "2.5.0",
    "description": "Custom Radio lets you browse and play your own `.wav` music files directly from the `/RADIO` folder, giving you full control over your playlist.",
    "type": "APP",
    "instructions": "Upload your '.wav' files to the '/RADIO' folder. To open on the Pip-Boy navigate to the tab RADIO > CUSTOM.",
    "tip": "Avoid adding more than 100 songs to the `/RADIO` folder to keep performance smooth. Press the knob again to stop playback.",
    "controls": "Turn the top-left knob to scroll through songs. Press it to play or stop a track.",
    "zip": "CustomRadio.zip",
    "authors": [
      "@CodyTolene"
    ],
    "isBootloaderRequired": true
  },
  {
    "id": "FileExplorer",
    "name": "File Explorer",
    "version": "2.1.1",
    "description": "A lightweight file explorer for the Pip-Boy 3000 Mk V. Browse your device's file system and interact with files directly.",
    "type": "APP",
    "instructions": "Navigate files on the Pip-Boy and select them to view or play them.",
    "tip": "Press play again to stop currently playing media.",
    "controls": "Use the top-left or top-right rotary wheels or the front radio tuner to scroll. Press the left rotary wheel or front radio tuner to play or stop media. Press the top torch button to restart the device.",
    "zip": "FileExplorer.zip",
    "authors": [
      "@CodyTolene"
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "GameExample",
    "name": "Game Example",
    "version": "1.0.0",
    "description": "A game example that you can use as a template for your own game.",
    "type": "GAME",
    "instructions": "",
    "tip": "",
    "controls": "",
    "zip": "GameExample.zip",
    "authors": [
      ""
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "PipPong",
    "name": "Pip-Pong",
    "version": "1.2.0",
    "description": "Pip-Pong is a simple game where you control a paddle that hits a ball back and forth.",
    "type": "GAME",
    "instructions": "Move the paddle up and down to hit the ball back and forth. Try to keep the ball in play as long as possible.",
    "tip": "The ball will bounce off the walls.",
    "controls": "Use any knob to move up and down, and the top torch button to exit the game.",
    "zip": "PipPong.zip",
    "authors": [
      "@CodyTolene"
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "PipSnake",
    "name": "Pip-Snake",
    "version": "1.2.0",
    "description": "Pip-Snake is a simple game where you control a growing snake that eats food and avoids crashing into itself.",
    "type": "GAME",
    "instructions": "Move the snake to eat food and grow. The game ends when you crash into yourself.",
    "tip": "The snake wraps around when it hits the edge of the screen.",
    "controls": "Use any knobs to move clockwise and counter-clockwise, the front radio tuner button to restart, and the top torch button to exit the game.",
    "zip": "PipSnake.zip",
    "authors": [
      "@CodyTolene"
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "PipTacToe",
    "name": "Pip-Tac-Toe",
    "version": "1.1.2",
    "description": "A fun Tic-Tac-Toe game for the Pip-Boy 3000 Mk V.",
    "type": "GAME",
    "instructions": "",
    "tip": "",
    "controls": "",
    "zip": "PipTacToe.zip",
    "authors": [
      "@pip-4111"
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "Piptris",
    "name": "Piptris",
    "version": "2.1.0",
    "description": "A simple Tetris inspired game for the Pip-Boy 3000 Mk V.",
    "type": "GAME",
    "instructions": "As blocks fall, rotate and move them to create complete lines. When a line is completed, it will disappear for points. The game ends when the blocks reach the top of the screen.",
    "tip": "Try to clear as many lines as possible!",
    "controls": "Use the top-left knob to rotate pieces, press to drop piece instantly. Use the top-right knob to move pieces left and right. Press the front radio tuner button to move pieces faster. Press the top torch button to exit.",
    "zip": "Piptris.zip",
    "authors": [
      "@CodyTolene"
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "StatsDisplay",
    "name": "Stats Display",
    "version": "2.4.0",
    "description": "The SPECIAL/Skills/Perks menu for the Pip-Boy 3000 Mk V.",
    "type": "APP",
    "instructions": "",
    "tip": "",
    "controls": "Use the scroll wheel to navigate the menu and the right scroller to switch between screens. Clicking the wheel on a stat will allow you to edit its value. Clicking the wheel in the perks page takes you to the perk config screen - to save changes, scroll the right scroller.",
    "zip": "StatsDisplay.zip",
    "authors": [
      "@gnargle"
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "ThemePicker",
    "name": "Theme Picker",
    "version": "1.0.2",
    "description": "A better theme picker, with finer colour picker control and the ability to change the scan line to a different colour for highlighting.",
    "type": "APP",
    "instructions": "",
    "tip": "",
    "controls": "Use the right wheel to select RGB value to change, and the left wheel to modify its value.",
    "zip": "ThemePicker.zip",
    "authors": [
      "@gnargle"
    ],
    "isBootloaderRequired": true
  },
  {
    "id": "VaultBreaker",
    "name": "Vault Breaker",
    "version": "1.0.1",
    "description": "A classic brick-breaking game.",
    "type": "GAME",
    "instructions": "",
    "tip": "Try to get the ball between or behind bricks!",
    "controls": "Press down the left wheel to launch the ball. Use the top-right wheel to move the paddle. Press the torch button to quit.",
    "zip": "VaultBreaker.zip",
    "authors": [
      "@TetrisKid48"
    ],
    "isBootloaderRequired": false
  },
  {
    "id": "Wasteland",
    "name": "Wasteland",
    "version": "1.1.0",
    "description": "A DOOM inspired RPG engine for the Pip-Boy 3000 Mk V.",
    "type": "GAME",
    "instructions": "",
    "tip": "",
    "controls": "Use the front radio on/off button to move forward. Turn top left or top right knob to rotate character 45 degrees. Press top left knob to move backwards. Press the top torch button to exit.",
    "zip": "Wasteland.zip",
    "authors": [
      "@CodyTolene"
    ],
    "isBootloaderRequired": false
  }
]
